---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.RemovingUndividedDPartParents
source: html/7aaf7359-14cf-c526-1591-8b12f08f04c1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.RemovingUndividedDPartParents Property

These parts are not intersected by any dividing references. They will be removed from the division.

## Syntax (C#)
```csharp
public static FailureDefinitionId RemovingUndividedDPartParents { get; }
```